aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx23w/register_access/iccrx/iodefine.h
#define	MSTP_DMAC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC0	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC1	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC2	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC3	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DA		SYSTEM.MSTPCRA.BIT.MSTPA19
#define	MSTP_S12AD	SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT2	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_CMT3	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_TPU	SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU0	SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU1	SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU2	SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU3	SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU4	SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU5	SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_MTU	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU0	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU1	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU2	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU3	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU4	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_TMR0	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR1	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR01	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR2	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR3	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR23	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SMCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SMCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_BLE	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_USB0	SYSTEM.MSTPCRB.BIT.MSTPB19
#define	MSTP_RSPI0	SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_CMPB	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_ELC	SYSTEM.MSTPCRB.BIT.MSTPB9
#define	MSTP_DOC	SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_SCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_SMCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_RSCAN	SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_RSCAN0	SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_SCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SMCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_IRDA	SYSTEM.MSTPCRC.BIT.MSTPC20
#define	MSTP_CAC	SYSTEM.MSTPCRC.BIT.MSTPC19
#define	MSTP_RAM0	SYSTEM.MSTPCRC.BIT.MSTPC0
#define	MSTP_TSIP	SYSTEM.MSTPCRD.BIT.MSTPD31
#define	MSTP_SDHI	SYSTEM.MSTPCRD.BIT.MSTPD19
#define	MSTP_SSI0	SYSTEM.MSTPCRD.BIT.MSTPD15
#define	MSTP_CTSU	SYSTEM.MSTPCRD.BIT.MSTPD10

#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	BSC		(*(volatile struct st_bsc        __sfr __evenaccess *)0x81300)
#define	CAC		(*(volatile struct st_cac        __sfr __evenaccess *)0x8B000)
#define	CMPB	(*(volatile struct st_cmpb       __sfr __evenaccess *)0x8C5A0)
#define	CMT		(*(volatile struct st_cmt        __sfr __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0       __sfr __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0       __sfr __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0       __sfr __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0       __sfr __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc        __sfr __evenaccess *)0x88280)
#define	CTSU	(*(volatile struct st_ctsu       __sfr __evenaccess *)0xA0900)
#define	DA		(*(volatile struct st_da         __sfr __evenaccess *)0x88040)
#define	DMAC	(*(volatile struct st_dmac       __sfr __evenaccess *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0      __sfr __evenaccess *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1      __sfr __evenaccess *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1      __sfr __evenaccess *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1      __sfr __evenaccess *)0x820C0)
#define	DOC		(*(volatile struct st_doc        __sfr __evenaccess *)0x8B080)
#define	DTC		(*(volatile struct st_dtc        __sfr __evenaccess *)0x82400)
#define	ELC		(*(volatile struct st_elc        __sfr __evenaccess *)0x8B100)
#define	FLASH	(*(volatile struct st_flash      __sfr __evenaccess *)0x7FC090)
#define	FLASHCONST		(*(volatile struct st_flashconst __sfr __evenaccess *)0x7FC350)
#define	ICU		(*(volatile struct st_icu        __sfr __evenaccess *)0x87000)
#define	IRDA	(*(volatile struct st_irda       __sfr __evenaccess *)0x88410)
#define	IWDT	(*(volatile struct st_iwdt       __sfr __evenaccess *)0x88030)
#define	LPT		(*(volatile struct st_lpt        __sfr __evenaccess *)0x800B0)
#define	MPC		(*(volatile struct st_mpc        __sfr __evenaccess *)0x8C11F)
#define	MPU		(*(volatile struct st_mpu        __sfr __evenaccess *)0x86400)
#define	MTU		(*(volatile struct st_mtu        __sfr __evenaccess *)0xD0A0A)
#define	MTU0	(*(volatile struct st_mtu0       __sfr __evenaccess *)0xD0A90)
#define	MTU1	(*(volatile struct st_mtu1       __sfr __evenaccess *)0xD0A90)
#define	MTU2	(*(volatile struct st_mtu2       __sfr __evenaccess *)0xD0A92)
#define	MTU3	(*(volatile struct st_mtu3       __sfr __evenaccess *)0xD0A00)
#define	MTU4	(*(volatile struct st_mtu4       __sfr __evenaccess *)0xD0A00)
#define	POE		(*(volatile struct st_poe        __sfr __evenaccess *)0x88900)
#define	PORT0	(*(volatile struct st_port0      __sfr __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1      __sfr __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2      __sfr __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3      __sfr __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4      __sfr __evenaccess *)0x8C004)
#define	PORTB	(*(volatile struct st_portb      __sfr __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc      __sfr __evenaccess *)0x8C00C)
#define	PORTD	(*(volatile struct st_portd      __sfr __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte      __sfr __evenaccess *)0x8C00E)
#define	PORTJ	(*(volatile struct st_portj      __sfr __evenaccess *)0x8C012)
#define	RIIC0	(*(volatile struct st_riic       __sfr __evenaccess *)0x88300)
#define	RSCAN	(*(volatile struct st_rscan      __sfr __evenaccess *)0xA8322)
#define	RSCAN0	(*(volatile struct st_rscan0     __sfr __evenaccess *)0xA8300)
#define	RSPI0	(*(volatile struct st_rspi       __sfr __evenaccess *)0x88380)
#define	RTC		(*(volatile struct st_rtc        __sfr __evenaccess *)0x8C400)
#define	S12AD	(*(volatile struct st_s12ad      __sfr __evenaccess *)0x89000)
#define	SCI1	(*(volatile struct st_sci1       __sfr __evenaccess *)0x8A020)
#define	SCI5	(*(volatile struct st_sci1       __sfr __evenaccess *)0x8A0A0)
#define	SCI8	(*(volatile struct st_sci1       __sfr __evenaccess *)0x8A100)
#define	SCI12	(*(volatile struct st_sci12      __sfr __evenaccess *)0x8B300)
#define	SDHI	(*(volatile struct st_sdhi       __sfr __evenaccess *)0x8AC00)
#define	SMCI1	(*(volatile struct st_smci       __sfr __evenaccess *)0x8A020)
#define	SMCI5	(*(volatile struct st_smci       __sfr __evenaccess *)0x8A0A0)
#define	SMCI8	(*(volatile struct st_smci       __sfr __evenaccess *)0x8A100)
#define	SMCI12	(*(volatile struct st_smci       __sfr __evenaccess *)0x8B300)
#define	SSI0	(*(volatile struct st_ssi        __sfr __evenaccess *)0x8A500)
#define	SYSTEM	(*(volatile struct st_system     __sfr __evenaccess *)0x80000)
#define	TEMPSCONST		(*(volatile struct st_tempsconst __sfr __evenaccess *)0x7FC0AC)
#define	TMR0	(*(volatile struct st_tmr0       __sfr __evenaccess *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1       __sfr __evenaccess *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0       __sfr __evenaccess *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1       __sfr __evenaccess *)0x88211)
#define	TMR01	(*(volatile struct st_tmr01      __sfr __evenaccess *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01      __sfr __evenaccess *)0x88214)
#define	TPU		(*(volatile struct st_tpu        __sfr __evenaccess *)0x88100)
#define	TPU0	(*(volatile struct st_tpu0       __sfr __evenaccess *)0x88108)
#define	TPU1	(*(volatile struct st_tpu1       __sfr __evenaccess *)0x88108)
#define	TPU2	(*(volatile struct st_tpu2       __sfr __evenaccess *)0x8810A)
#define	TPU3	(*(volatile struct st_tpu3       __sfr __evenaccess *)0x8810A)
#define	TPU4	(*(volatile struct st_tpu4       __sfr __evenaccess *)0x8810C)
#define	TPU5	(*(volatile struct st_tpu5       __sfr __evenaccess *)0x8810C)
#define	USB0	(*(volatile struct st_usb        __sfr __evenaccess *)0xA0000)
#define	WDT		(*(volatile struct st_wdt        __sfr __evenaccess *)0x88020)

typedef enum enum_ir {
IR_BSC_BUSERR=16,IR_FCU_FRDYI=23,
IR_ICU_SWINT=27,
IR_CMT0_CMI0,
IR_CMT1_CMI1,
IR_CMT2_CMI2,
IR_CMT3_CMI3,
IR_CAC_FERRF,IR_CAC_MENDF,IR_CAC_OVFF,
IR_USB0_D0FIFO0=36,IR_USB0_D1FIFO0,IR_USB0_USBI0,
IR_SDHI_SBFAI=40,IR_SDHI_CDETI,IR_SDHI_CACI,IR_SDHI_SDACI,
IR_RSPI0_SPEI0,IR_RSPI0_SPRI0,IR_RSPI0_SPTI0,IR_RSPI0_SPII0,
IR_RSCAN_COMFRXINT=52,IR_RSCAN_RXFINT,IR_RSCAN_TXINT,IR_RSCAN_CHERRINT,IR_RSCAN_GLERRINT,
IR_DOC_DOPCF,
IR_CTSU_CTSUWR=60,IR_CTSU_CTSURD,IR_CTSU_CTSUFN,
IR_RTC_CUP,
IR_ICU_IRQ0,IR_ICU_IRQ1,
IR_BLE_BLEIRQ=67,
IR_ICU_IRQ4,IR_ICU_IRQ5,IR_ICU_IRQ6,IR_ICU_IRQ7,
IR_ELC_ELSR8I=80,
IR_LVD_LVD1=88,
IR_USB0_USBR0=90,
IR_VBATT_VBTLVDI,
IR_RTC_ALM,IR_RTC_PRD,
IR_S12AD_S12ADI0=102,IR_S12AD_GBADI,
IR_CMPB1_CMPB2,IR_CMPB1_CMPB3,
IR_ELC_ELSR18I,IR_ELC_ELSR19I,
IR_SSI0_SSIF0,IR_SSI0_SSIRXI0,IR_SSI0_SSITXI0,
IR_TSIP_RD,IR_TSIP_WR,IR_TSIP_ERR,
IR_MTU0_TGIA0,IR_MTU0_TGIB0,IR_MTU0_TGIC0,IR_MTU0_TGID0,IR_MTU0_TCIV0,IR_MTU0_TGIE0,IR_MTU0_TGIF0,
IR_MTU1_TGIA1,IR_MTU1_TGIB1,IR_MTU1_TCIV1,IR_MTU1_TCIU1,
IR_MTU2_TGIA2,IR_MTU2_TGIB2,IR_MTU2_TCIV2,IR_MTU2_TCIU2,
IR_MTU3_TGIA3,IR_MTU3_TGIB3,IR_MTU3_TGIC3,IR_MTU3_TGID3,IR_MTU3_TCIV3,
IR_MTU4_TGIA4,IR_MTU4_TGIB4,IR_MTU4_TGIC4,IR_MTU4_TGID4,IR_MTU4_TCIV4,
IR_TPU0_TGI0A=142,IR_TPU0_TGI0B,IR_TPU0_TGI0C,IR_TPU0_TGI0D,IR_TPU0_TCI0V,
IR_TPU1_TGI1A,IR_TPU1_TGI1B,IR_TPU1_TCI1V,IR_TPU1_TCI1U,
IR_TPU2_TGI2A,IR_TPU2_TGI2B,IR_TPU2_TCI2V,IR_TPU2_TCI2U,
IR_TPU3_TGI3A,IR_TPU3_TGI3B,IR_TPU3_TGI3C,IR_TPU3_TGI3D,IR_TPU3_TCI3V,
IR_TPU4_TGI4A,IR_TPU4_TGI4B,IR_TPU4_TCI4V,IR_TPU4_TCI4U,
IR_TPU5_TGI5A,IR_TPU5_TGI5B,IR_TPU5_TCI5V,IR_TPU5_TCI5U,
IR_POE_OEI1=170,IR_POE_OEI2,
IR_TMR0_CMIA0=174,IR_TMR0_CMIB0,IR_TMR0_OVI0,
IR_TMR1_CMIA1,IR_TMR1_CMIB1,IR_TMR1_OVI1,
IR_TMR2_CMIA2,IR_TMR2_CMIB2,IR_TMR2_OVI2,
IR_TMR3_CMIA3,IR_TMR3_CMIB3,IR_TMR3_OVI3,
IR_DMAC_DMAC0I=198,IR_DMAC_DMAC1I,IR_DMAC_DMAC2I,IR_DMAC_DMAC3I,
IR_SCI1_ERI1=218,IR_SCI1_RXI1,IR_SCI1_TXI1,IR_SCI1_TEI1,
IR_SCI5_ERI5,IR_SCI5_RXI5,IR_SCI5_TXI5,IR_SCI5_TEI5,
IR_BLE_ERI,IR_BLE_RXI,IR_BLE_TXI,IR_BLE_TEI,
IR_SCI8_ERI8,IR_SCI8_RXI8,IR_SCI8_TXI8,IR_SCI8_TEI8,
IR_SCI12_ERI12=238,IR_SCI12_RXI12,IR_SCI12_TXI12,IR_SCI12_TEI12,IR_SCI12_SCIX0,IR_SCI12_SCIX1,IR_SCI12_SCIX2,IR_SCI12_SCIX3,
IR_RIIC0_EEI0,IR_RIIC0_RXI0,IR_RIIC0_TXI0,IR_RIIC0_TEI0
} enum_ir_t;

